app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page])

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "<div>This f title+invite edit</div>"], ["updated_at", "2017-09-03 13:54:59.697211"], ["id", 1]]
---
  def update
    if  admin
    @post.update_attributes(post_params)