app/controllers/sessions_controller.rb

  def create
    render 'new'
    user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "sad"], ["LIMIT", 1]]