app/controllers/users_controller.rb

  def create
  @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "pozetiv1"], ["password_digest", "$2a$10$w72qoG77N4YqztdZWcwDUezaDpMKTeI7eXi5T1nYNg/k8.d6MB/Ea"], ["updated_at", "2017-08-20 19:22:59.921721"], ["id", 1]]